from tqdm import tqdm


# Динамическое отображение текущего состояния итерации
def show_iteration(any_iter):
    tqdm(any_iter)


''' 0.9119628551457357 - все часы
0.9084221162744054 - часы с шагом 2

(0.91893326713077, {'C': 4.6415888336127775}) - попытка закурвофититься
(0.9128185514855045, {'C': 4.6415888336127775}) - все месяцы и часы
(0.9249794231106563, {'C': 1.6681005372000592}) - без моих мастурбаций
(0.9241660690551358, {'C': 4.6415888336127775}) - от 5 до 12 месяца
(0.9242346975697946, {'C': 4.6415888336127775}) - 5 и 9 месяц
'''